Project/frontend/views/company/index.php

SELECT * FROM `user` WHERE `id`=2
SELECT * FROM `company` WHERE `id`=1
---
                                    <?php Pjax::begin(); ?>
                                    <?php $dataProvider->pagination->pageSize = 5; ?>

                                    <?=
                                    GridView::widget([
                                        'dataProvider' => $dataProvider,
                                        'filterModel' => $searchModel,
                                        'columns' => [
                                            ['class' => 'yii\grid\SerialColumn'],
                                            'company_name',
                                            'website',
                                            [
                                                'label' => 'Admin Name',
                                                'value' => function ($model, $index) {
                                                    return User::findOne(['id' => $model->company_admin_id])->first_name;
                                                }
                                            ],
                                            [
                                                'label' => 'Admin Email',
                                                'value' => function ($model, $index) {
                                                    return User::findOne(['id' => $model->company_admin_id])->email;
                                                }
                                            ],
                                            [
                                                'label' => 'Admin Mobile Number',
                                                'value' => function ($model, $index) {
                                                    return User::findOne(['id' => $model->company_admin_id])->phone;
                                                }