Project/frontend/controllers/CompanyController.php

    protected function findModel($id) {
        if (($model = Company::findOne($id)) !== null) {
---
SELECT * FROM `company` WHERE `id`='1'