Project/frontend/controllers/CoursesAssignedController.php

public function behaviors()
    {
        return [
            'verbs' => [
                'class' => VerbFilter::className(),
                'actions' => [
                    'delete' => ['post'],
                ],
            ],
            'access' => [
                        'class' => \yii\filters\AccessControl::className(),
                        'only' => ['index','create','update','view','my-courses'],
                        'rules' => [
                            // allow authenticated users
                            [
                                'allow' => true,
                                'roles' => ['@'],
                                                        'matchCallback' => function () {
                            return User::findOne(['id' => Yii::$app->user->identity->id])->two_fact === 1;
---
SELECT * FROM `user` WHERE `id`=3

    public function actionMyCourses() {
        $searchModel = new CoursesAssignedSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $query = CoursesAssigned::find()->where(['user_id' => Yii::$app->user->id, 'blocked_status' => 1]);
        $pagination = new Pagination(['totalCount' => $query->count(), 'pageSize' => 4]);
        $array = [];
        // limit the query using the pagination and retrieve the articles
                $articles = $query->offset($pagination->offset)
                ->limit($pagination->limit)
                ->all();
        $dataQuery = $query->all();


        foreach ($dataQuery as $dataQuery) {
            $array [] = Courses::find()->where(['id' => $dataQuery->courses_assigned])->one();
---
SELECT COUNT(*) FROM `courses_assigned` WHERE (`user_id`=3) AND (`blocked_status`=1)
SELECT * FROM `courses_assigned` WHERE (`user_id`=3) AND (`blocked_status`=1) LIMIT 4
SELECT * FROM `courses` WHERE `id`=4