Project/frontend/controllers/LearnerActivityController.php

SELECT * FROM `courses` WHERE `id`='1'
SELECT * FROM `lessons` WHERE `id`='1'
SELECT * FROM `sections` WHERE `id`='2'
SELECT * FROM `learner_activity` WHERE (`learner_id`=2) AND (`lesson_id`='1') AND (`section_id`='2') AND (`completion_status`=1)
SELECT * FROM `learners` WHERE `user_id`=7
---
    public function actionGetCourseMaterials($course_id, $lesson_id, $section_id) {
        $course_name = Courses::findOne(['id' => $course_id])->course_name;
        $lesson_name = Lessons::findOne(['id' => $lesson_id])->lesson_name;
        $folder_name = Sections::findOne(['id' => $section_id])->folder_name;
        $learner_activity = LearnerActivity::find()
                ->where([
                    'learner_id' => Learners::findOne(['user_id' => Yii::$app->user->identity->id])->id,
                    'lesson_id' => $lesson_id,
                    'section_id' => $section_id,
                    'completion_status' => 1
                ])
                ->one();

SELECT * FROM `learners` WHERE `user_id`=7
---
    public function actionCompleteSection($section_id) {
        $connection = Yii::$app->db;
        $connection->createCommand()
                ->update('learner_activity', ['completion_status' => 1], 'section_id = ' . $section_id . ' AND learner_id = ' . Learners::findOne(['user_id' => Yii::$app->user->identity->id])->id)
                ->execute();

SELECT * FROM `learner_activity` WHERE (`learner_id`=2) AND (`lesson_id`='1') AND (`section_id`='2')
---
    public function actionGetSession($course_id, $lesson_id, $section_id) {
        $course_name = Courses::findOne(['id' => $course_id])->course_name;
        $lesson_name = Lessons::findOne(['id' => $lesson_id])->lesson_name;
        $folder_name = Sections::findOne(['id' => $section_id])->folder_name;

        $dir_path = 'uploads/courses/' . $course_name . '/' . $lesson_name . '/' . $folder_name;


        $files = scandir($dir_path);

        $total_slides = count($files) - 2;

        $learner_activity = LearnerActivity::find()
                ->where([
                    'learner_id' => Learners::findOne(['user_id' => Yii::$app->user->identity->id])->id,
                    'lesson_id' => $lesson_id,
                    'section_id' => $section_id
                ])
                ->one();

SELECT * FROM `learners` WHERE `user_id`=2
---
    public function actionUpdateSession($lesson_id, $section_id, $current) {
        $learner_activity = LearnerActivity::find()
                ->where([
                    'learner_id' => Learners::findOne(['user_id' => Yii::$app->user->identity->id])->id,
                    'lesson_id' => $lesson_id,
                    'section_id' => $section_id
                ])
                ->one();

        if ($learner_activity->current_slide_no < $current) {
            $connection = Yii::$app->db;
            $connection->createCommand()
                    ->update('learner_activity', ['current_slide_no' => $current], 'lesson_id = ' . $lesson_id . ' AND section_id = ' . $section_id . ' AND learner_id = ' . Learners::findOne(['user_id' => Yii::$app->user->identity->id])->id)
                    ->execute();

SELECT * FROM `learner_activity` WHERE (`learner_id`=2) AND (`lesson_id`='1') AND (`section_id`='1') AND (`completion_status`=1)
SELECT * FROM `learners` WHERE `user_id`=7
---
    public function actionEnableNextSection($course_id, $lesson_id, $section_id) {
        $course_name = Courses::findOne(['id' => $course_id])->course_name;
        $lesson_name = Lessons::findOne(['id' => $lesson_id])->lesson_name;
        $folder_name = Sections::findOne(['id' => $section_id])->folder_name;
        $dir_path = 'uploads/courses/' . $course_name . '/' . $lesson_name . '/' . $folder_name;

        $files = scandir($dir_path);

        $total_slides = count($files) - 2;

        $connection = Yii::$app->db;
        $connection->createCommand()->insert('learner_activity', [
                    'learner_id' => Learners::findOne(['user_id' => Yii::$app->user->identity->id])->id,
                    'lesson_id' => $lesson_id,
                    'section_id' => $section_id,
                    'current_slide_no' => 1,
                    'total_slides' => $total_slides,
                    'completion_status' => 0,
                    'created_at' => date('Y-m-d h:i:s'),
                    'created_by' => Yii::$app->user->identity->id,
                    'updated_at' => date('Y-m-d h:i:s'),
                    'updated_by' => Yii::$app->user->identity->id,
                ])
                ->execute();