Project/frontend/controllers/LoginAnswerController.php

    public function actionMatch($id) {
        if (!Yii::$app->user->isGuest) {
            $cryptKey = '1bv4ha3ar1ts4ha3';
            $question_no = rtrim(mcrypt_decrypt(MCRYPT_RIJNDAEL_256, md5($cryptKey), base64_decode(str_pad(strtr($id, '-_', '+/'), strlen($id) % 4, '=', STR_PAD_RIGHT)), MCRYPT_MODE_CBC, md5(md5($cryptKey))), "\0");
            $model = LoginAnswer::findOne(['answered_by' => Yii::$app->user->identity->id, 'question_id' => $question_no])->question_id;
---
SELECT * FROM `login_answer` WHERE (`answered_by`=1) AND (`question_id`='4')

    public function actionCheckPasswords($password, $id) {


        $data = LoginAnswer::findOne(['answered_by' => Yii::$app->user->identity->id, 'question_id' => $id])->answer;
---
SELECT * FROM `login_answer` WHERE (`answered_by`=1) AND (`question_id`='4')