Project/frontend/controllers/ReviewMaterialScoringController.php

SELECT * FROM `review_material` WHERE `course_id`='1'
SELECT * FROM `master_review_material_type`
SELECT * FROM `review_material` WHERE (`course_id`='1') AND (`review_material_type_id`=2) AND (`id` NOT IN (SELECT `review_material_id` FROM `review_material_scoring` WHERE `learner_id`=7))
SELECT * FROM `review_material` WHERE (`course_id`='1') AND (`review_material_type_id`=3) AND (`id` NOT IN (SELECT `review_material_id` FROM `review_material_scoring` WHERE `learner_id`=7))
---
    public function actionReviewMaterialScore($id) {
        $review_material = ReviewMaterial::find()->where(['course_id' => $id])->all();
        $master_reviewmaterial = MasterReviewMaterialType::find()->all();

        $subQuery = ReviewMaterialScoring::find()->select(['review_material_id'])
                ->where(['learner_id' => Yii::$app->user->identity->id]);

        $daily = ReviewMaterial::find()
                ->where(['course_id' => $id])
                ->andWhere(['review_material_type_id' => 1])
                ->andwhere(['not in', 'id', $subQuery])
                ->all();
        $weekly = ReviewMaterial::find()
                ->where(['course_id' => $id])
                ->andWhere(['review_material_type_id' => 2])
                ->andwhere(['not in', 'id', $subQuery])
                ->all();