Project/frontend/controllers/SiteController.php

SELECT * FROM `user` WHERE `id`=1
---
    public function behaviors() {
        return [
            'access' => [
                'class' => AccessControl::className(),
                'only' => ['access-buttons', 'dashboard-branchmanager', 'dashboard-company', 'dashboard-content', 'dashboard-course', 'dashboard-learner', 'home', 'index','documents-data-log'],
                'rules' => [
                    [
                        'actions' => ['access-buttons', 'dashboard-branchmanager', 'dashboard-company', 'dashboard-content', 'dashboard-course', 'dashboard-learner', 'home', 'index','documents-data-log'],
                        'allow' => true,
                        'roles' => ['@'],
                        'matchCallback' => function () {
                            return User::findOne(['id' => Yii::$app->user->identity->id])->two_fact === 1;

SELECT * FROM `user` WHERE `id`=3
SELECT * FROM `user` WHERE `id`=1
---
                ]);
            } else if ($role_type == 4) {

                $branch_manager_id = User::findOne(['id' => Yii::$app->user->identity->id]);
                if ($branch_manager_id->email == 'maheshaansystem@gmail.com') {
                    return $this->redirect('site/dashboard-learner');
                } else {
                    $company_id = User::findOne(['id' => $branch_manager_id->created_by])->created_by;

SELECT * FROM `courses`
SELECT * FROM `courses` WHERE `id`=4
---
    public function actionCourse($date) {
        $learners_count = [];
        $course_names = [];
        $end_date = date("Y-m-t", strtotime($date));
        $all_data = [];
        $combined_arrays = [];

        $courses = Courses::find()->all();
        foreach ($courses as $course) {
            $query = "SELECT * FROM `courses_assigned` AS a, `user` AS b WHERE DATE_FORMAT(b.`created_at`,'%Y-%m-%d') BETWEEN '" . $date . "' AND '" . $end_date . "' AND a.`user_id` = b.`id` AND b.`role_type` = 4 AND b.`status` = 10 AND  a.`blocked_status` = 1 AND a.`courses_assigned` = " . $course->id;
            $connection = Yii::$app->db;
            $command = $connection->createCommand($query);
            $result = $command->queryAll();

            array_push($learners_count, count($result));
            array_push($course_names, Courses::findOne(['id' => $course->id])->course_name);