Project/frontend/models/BranchesSearch.php

    public function search($params)
    {
        $query = Branches::find()->OrderBy(['id'=>SORT_DESC]);

        // add conditions that should always apply here

        $dataProvider = new ActiveDataProvider([
            'query' => $query,
        ]);

        $this->load($params);

        if (!$this->validate()) {
            // uncomment the following line if you do not want to return any records when validation fails
            // $query->where('0=1');
            return $dataProvider;
        }

        // grid filtering conditions
        $query->andFilterWhere([
            'id' => $this->id,
            'company_id' => Company::findOne(['company_admin_id'=> Yii::$app->user->identity->id])->id,
---
SELECT * FROM `company` WHERE `company_admin_id`=2