Project/frontend/views/layouts/nav-bar.php

SELECT * FROM `super_admin_notifications` WHERE `start_date` BETWEEN '2019-04-01' AND '2019-04-30' ORDER BY `id` DESC
---
              <span class="notification">                                    <?php
                                    $start_date = date('Y-m-01');  //hard coded date for month start
                                    $end_date = date('Y-m-t'); //hard coded date for month end
                                    $notifications = SuperAdminNotifications::find()->OrderBy(['id' => SORT_DESC])
                                                    ->where(['between', 'start_date', $start_date, $end_date])->all();

SELECT * FROM `user` WHERE `id`=3
---
              <span class="notification">
                          <?php
                                    /* query to fetch the created_by based on loged in user */
                                    $user = User::findOne(['id' => Yii::$app->user->identity->id]);

SELECT * FROM `super_admin_notifications` WHERE (`assigned_to`=3) AND (`end_date` BETWEEN '2019-03-15' AND '2019-03-31') ORDER BY `id` DESC
---
                                    if ($created_by == 1) {
                                        $start_date = date('Y-m-d'); //to take current date
                                        $end_date = date('Y-m-t');  //hard coded date for month end
                                        $notifications = SuperAdminNotifications::find()->OrderBy(['id' => SORT_DESC])
                                                        ->where(['assigned_to' => Yii::$app->user->identity->id])
                                                        ->andWhere(['between', 'end_date', $start_date, $end_date])->all();