Project/common/models/User.php

SELECT * FROM `user` WHERE `email`='superadmin@vivaanlms.com'
---
    public static function findByEmail($email) {
        $user = User::find()->where(['email' => $email])->one();