Project/frontend/views/branches/index.php

                                        <div class="col-md-12">
                                            <?php Pjax::begin(); ?>
                                            <?php $dataProvider->pagination->pageSize = 5; ?>
                                            <?=
                                            GridView::widget([
                                                'dataProvider' => $dataProvider,
                                                'filterModel' => $searchModel,
                                                'columns' => [
                                                    ['class' => 'yii\grid\SerialColumn'],
                                                    [
                                                        'label' => 'Branch Name',
                                                        'value' => function ($model, $index, $widget) {
                                                            return Branches::findOne(['id' => $model->id])->branch_name;
                                                        }
                                                    ],
                                                    ['class' => 'yii\grid\ActionColumn',
                                                        'header' => 'Actions',
                                                    ],
                                                ],
                                            ]);
---
SELECT * FROM `branches` WHERE `id`=1