Project/frontend/views/site/documents-data-log.php

SELECT COUNT(*) FROM `documents_log`
---
        $documents_log = $query->all();
    } else {
        $query = DocumentsLog::find();
        $documents_count = DocumentsLog::find()->count();

SELECT * FROM `documents_log` LIMIT 5 OFFSET 115
---
        foreach ($branch_id as $branches_id) {
            $learner_id = User::findAll(['created_by' => $branches_id->id]);
            foreach ($learner_id as $learners_id) {
                $document = DocumentsLog::findAll(['user_id' => $learners_id->id, 'document_type' => $id]);

SELECT `id`, `template_name` FROM `master_doc_templates`
---
        $array = [];
    }
}
$document_type_id = MasterDocTemplates::find()->select(['id', 'template_name'])->all();

SELECT `document_name`, `document_type` FROM `documents` WHERE `id`=58
SELECT * FROM `master_doc_templates` WHERE `id` IN (NULL, NULL, 'Disaster Recovery Plan Template Vivaan-engage', '1', NULL, NULL, NULL, NULL, NULL, NULL, NULL)
SELECT * FROM `user` WHERE `id`=5
SELECT * FROM `user` WHERE `id`=3
---
                                            <?php
                                            $i = 1;
                                            foreach ($documents_log as $document_log) {
                                                $doc_type = Documents::find()->select(['document_name', 'document_type'])->where(['id' => $document_log['document_id']])->One();
                                                $document_type = MasterDocTemplates::findOne(['id' => $doc_type])->template_name;
                                                $assigned_to = User::findOne(['id' => $document_log['assigned_to']])->email;
                                                $document_author = User::findOne(['id' => $document_log['user_id']])->email;