Project/frontend/views/site/home.php

                <div class="card-content text-center">
                    <div class="row how-to-block">
                        <?php
                        $how_to_blocks = MasterHowTo::find()->all();
---
SELECT * FROM `master_how_to`