Project/frontend/views/learners/index.php


                                    <?php $dataProvider->pagination->pageSize = 5;  ?>

                                    <?=
                                    GridView::widget([
                                        'dataProvider' => $dataProvider,
                                        'filterModel' => $searchModel,
                                        'columns' => [
                                            ['class' => 'yii\grid\SerialColumn'],
                                            [
                                                'label' => 'Learner Name',
                                                'value' => function ($model, $index) {
                                                    return User::findOne(['id' => $model->user_id])->first_name;
                                                }
                                            ],
                                            [
                                                'label' => 'Email',
                                                'value' => function ($model, $index) {
                                                    return User::findOne(['id' => $model->user_id])->email;
                                                }
                                            ],
                                            [
                                                'label' => 'Mobile Number',
                                                'value' => function ($model, $index) {
                                                    return User::findOne(['id' => $model->user_id])->phone;
                                                }
                                            ],
                                            'designation',
                                            [
                                                'label' => 'Courses Assigned',
                                                'value' => function ($model, $index, $widget) {

                                                    $courses_assigned_list = CoursesAssigned::find()
                                                            ->where(['user_id' => $model->user_id, 'blocked_status' => 1])
                                                            ->all();
                                                    $courses_array = [];
                                                    foreach ($courses_assigned_list as $course) {
                                                        $course_name = Courses::findOne(['id' => $course->courses_assigned])->course_name;
                                                        array_push($courses_array, $course_name);
                                                    }
                                                    $a = implode($courses_array, ', ');

                                                    return $a;
                                                }
                                            ],
                                            [
                                                'label' => 'Blocked Courses',
                                                'value' => function ($model, $index, $widget) {

                                                    $courses_assigned_list = CoursesAssigned::find()
                                                            ->where(['user_id' => $model->user_id, 'blocked_status' => 0])
                                                            ->all();
                                                    $courses_array = [];
                                                    foreach ($courses_assigned_list as $course) {
                                                        $course_name = Courses::findOne(['id' => $course->courses_assigned])->course_name;
                                                        array_push($courses_array, $course_name);
                                                    }
                                                    $a = implode($courses_array, ', ');

                                                    return $a;
                                                }
                                            ],
---
SELECT * FROM `user` WHERE `id`=4
SELECT * FROM `courses_assigned` WHERE (`user_id`=4) AND (`blocked_status`=1)
SELECT * FROM `courses` WHERE `id`=1
SELECT * FROM `courses_assigned` WHERE (`user_id`=4) AND (`blocked_status`=0)