Project/frontend/views/test-assigned/index.php

                                                        [
                                                'label' => 'User Id',
                                                'value' => function ($model, $index) {
                                                    return User::findOne(['id' => $model->user_id])->email;
---
SELECT * FROM `user` WHERE `id`=3

                                                                                                            [
                                                'label' => 'Role',
                                                'value' => function ($model, $index) {
                                                    $role= User::findOne(['id' => $model->user_id])->role_type;
                                                         return MasterRoleTypes::findOne(['id'=>$role])->role_name;
---
SELECT * FROM `user` WHERE `id`=3
SELECT * FROM `master_role_types` WHERE `id`=4

                                                                                                            [
                                                'label' => 'Quiz Name',
                                                'value' => function ($model, $index) {
                                                    return Subjects::findOne(['id' => $model->subject_assigned])->quiz_name;
---
SELECT * FROM `subjects` WHERE `id`=1