Project/frontend/views/login-answer/match.php

SELECT * FROM `login_questions` WHERE `id`=4
---
/* @var $model frontend\models\LoginAnswer */
/* @var $form yii\widgets\ActiveForm */

$questions = LoginQuestions::findOne(['id' => $model])->question;