Project/frontend/views/branch-managers/index.php

                                            <?php Pjax::begin(); ?>
                                            <?php $dataProvider->pagination->pageSize = 5; ?>

                                            <?=
                                            GridView::widget([
                                                'dataProvider' => $dataProvider,
                                                'filterModel' => $searchModel,
                                                'columns' => [
                                                    ['class' => 'yii\grid\SerialColumn'],
                                                    //'id',
                                                    //'branch_id',
                                                    [
                                                        'label' => 'Branch Name',
                                                        'value' => function ($model, $index, $widget) {
                                                            return Branches::findOne(['id' => $model->branch_id])->branch_name;
                                                        }
                                                    ],
                                                    [
                                                        'label' => 'Branch Manager Name',
                                                        'value' => function ($model, $index, $widget) {
                                                            return User::findOne(['id' => $model->user_id])->first_name;
                                                        }
                                                    ],
                                                    [
                                                        'label' => 'Branch Manager Email',
                                                        'value' => function ($model, $index, $widget) {
                                                            return User::findOne(['id' => $model->user_id])->email;
                                                        }
                                                    ],
---
SELECT * FROM `branches` WHERE `id`=1
SELECT * FROM `user` WHERE `id`=3
SELECT * FROM `user` WHERE `id`=4

                                                            return User::findOne(['id' => $model->user_id])->phone;
                                                        }
                                                    ],
                                                    /* [
                                                      'label'=>'Courses',
                                                      'value'=>function ($model, $index, $widget) {
                                                      return Courses::findOne(['user_id' => $model->id])->course_name;
                                                      }
                                                      ], */
                                                    [
                                                        'label' => 'Courses Assigned',
                                                        'value' => function ($model, $index, $widget) {
                                                            // echo $model->user_id;
                                                            $courses_assigned_list = CoursesAssigned::find()
                                                                    ->where(['user_id' => $model->user_id, 'blocked_status' => 1])
                                                                    ->all();
                                                            $courses_array = [];
                                                            foreach ($courses_assigned_list as $course) {
                                                                $course_name = Courses::findOne(['id' => $course->courses_assigned])->course_name;
                                                                array_push($courses_array, $course_name);
                                                            }
                                                            $a = implode($courses_array, ', ');
                                                            return $a;
                                                        }
                                                    ],
                                                    [
                                                        'label' => 'Blocked Courses',
                                                        'value' => function ($model, $index, $widget) {
                                                            // echo $model->user_id;
                                                            $courses_assigned_list = CoursesAssigned::find()
                                                                    ->where(['user_id' => $model->user_id, 'blocked_status' => 0])
                                                                    ->all();
                                                            $courses_array = [];
                                                            foreach ($courses_assigned_list as $course) {
                                                                $course_name = Courses::findOne(['id' => $course->courses_assigned])->course_name;
                                                                array_push($courses_array, $course_name);
                                                            }
                                                            $a = implode($courses_array, ', ');
                                                            return $a;
                                                        }
                                                    ],
---
SELECT * FROM `courses` WHERE `id`=1
SELECT * FROM `courses_assigned` WHERE (`user_id`=4) AND (`blocked_status`=1)
SELECT * FROM `courses_assigned` WHERE (`user_id`=4) AND (`blocked_status`=0)